app/Controllers/MainController.php

    public function index()
    {
        $hamburguersModel = new hamburguerModel();
        $hamburguers = $hamburguersModel->findAll();
---
SELECT *
FROM `Hamburguers`

    public function ingredientes()
    {
    $ingredientesModel = new IngredientesModel();
    $ingredientes = $ingredientesModel->findAll();
---
SELECT *
FROM `ingredientes`

    public function removerIngredientes($id)
    {
    $ingredientesModel = new IngredientesModel();
    $ingrediente = $ingredientesModel->find($id);

    if ($ingrediente) {
        if ($ingrediente['quantidade'] > 1) {
            $ingredientesModel->update($id, ['quantidade' => $ingrediente['quantidade'] - 1]);
        } else {
            $ingredientesModel->delete($id);
---
DELETE FROM `ingredientes`
WHERE `id_ing` IN ('2')

public function salvarEdicaoHamburguer($id)
{
    $hamburguerModel = new HamburguerModel();
    $hamburguer = $hamburguerModel->find($id);

    if ($hamburguer) {
        $dadosHamburguer = $this->request->getPost();
        $hamburguerModel->update($id, $dadosHamburguer);
---
UPDATE `Hamburguers` SET `nome` = 'Hamburguer Farroupilha', `valor` = '20'
WHERE `Hamburguers`.`id_hamb` IN ('18')

    public function salvarEdicaoIngrediente($id)
{
    $ingredientesModel = new IngredientesModel();
    $ingrediente = $ingredientesModel->find($id);

    if ($ingrediente) {
        $dadosIngrediente = $this->request->getPost();
        $ingredientesModel->update($id, $dadosIngrediente);
---
UPDATE `ingredientes` SET `nome` = 'Queijo', `quantidade` = '1'
WHERE `ingredientes`.`id_ing` IN ('2')

public function desativarHamburguer($id)
    {
        $hamburguerModel = new HamburguerModel();
        $hamburguer = $hamburguerModel->find($id);

        if ($hamburguer) {
            $hamburguerModel->update($id, ['ativo' => false]);
---
UPDATE `Hamburguers` SET `ativo` = 0
WHERE `Hamburguers`.`id_hamb` IN ('18')

    public function reativarHamburguer($id)
    {
        $hamburguerModel = new HamburguerModel();
        $hamburguer = $hamburguerModel->find($id);

        if ($hamburguer) {
            $hamburguerModel->update($id, ['ativo' => true]);
---
UPDATE `Hamburguers` SET `ativo` = 1
WHERE `Hamburguers`.`id_hamb` IN ('18')