app/Models/HamburguerModel.php

    public function salvarHamburguer($data)
    {
        $this->protect(false);
        $this->insert($data);
---
INSERT INTO `Hamburguers` (`nome`, `valor`) VALUES ('Hamburguer Farroupilha', '25')