app/Models/ingredientesModel.php

INSERT INTO `ingredientes` (`nome`, `quantidade`) VALUES ('Queijo Cheddar', '50')
---
    public function criarIngrediente($data)
    {
        $this->insert($data);